XKCANO/ceshi0223/KD001-0111/CMSIS/inc/fm33lf0xx.h

/****************************************************************************************************//**
 * @file     FM33LF0XX.h
 *
 * @brief    CMSIS Cortex-M0 Peripheral Access Layer Header File for
 *           FM33LF0XX from Keil.
 *
 * @version  V0.0.1
 * @date     09. may 2023
 *
 * @note     Generated with SVDConv V2.87e 
 *           from CMSIS SVD File 'FM33LF0XX.SVD' Version 1.0,
 *
 * @par      ARM Limited (ARM) is supplying this software for use with Cortex-M
 *           processor based microcontroller, but can be equally used for other
 *           suitable processor architectures. This file can be freely distributed.
 *           Modifications to this file shall be clearly marked.
 *           
 *           THIS SOFTWARE IS PROVIDED "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 *           OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 *           MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 *           ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 *           CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER. 
 *
 *******************************************************************************************************/


/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup FM33LF0XX
  * @{
  */

#ifndef __FM33LF0XX_H
#define __FM33LF0XX_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/**
  * @brief Configuration of the Cortex-M0 Processor and Core Peripherals 
  */
#define __CM0_REV                    0x0100U /*!< Cortex-M0 Core Revision                                               */
#define __MPU_PRESENT                0U      /*!< MPU present or not                                                    */
#define __VTOR_PRESENT               1U      /*!< VTOR present or not                                                   */
#define __NVIC_PRIO_BITS             2U      /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig       0U      /*!< Set to 1 if different SysTick Config is used                          */


/**
 * @brief FM33LF0XX Interrupt Number Definition, according to the selected device 
 *        in @ref Library_configuration_section 
 */
typedef enum {
/******  Cortex-M0 Processor Exceptions Numbers ****************************************************************/
  Reset_IRQn                    = -15,     /*!<  1  Reset Vector, invoked on Power up and warm reset           */
  NMI_IRQn                      = -14,     /*!<  2  Non maskable Interrupt, cannot be stopped or preempted     */
  HardFault_IRQn                = -13,     /*!<  3  Hard Fault, all classes of Fault                           */
  SVCall_IRQn                   = -5,      /*!<  11  System Service Call via SVC instruction                   */
  PendSV_IRQn                   = -2,      /*!<  14  Pendable request for system service                       */
  SysTick_IRQn                  = -1,      /*!<  15  System Tick Timer                                         */
/******  FM33LF0XX specific Interrupt Numbers ******************************************************************/
  WDT_IRQn                      = 0,       /*!<  0    WWDT and IWDT Interrupt                                  */
  SVD_IRQn                      = 1,       /*!<  1    SVD Interrupt                                            */
  RTC_IRQn                      = 2,       /*!<  2    RTC Interrupt                                            */
  FLASH_IRQn                    = 3,       /*!<  3    FLASH global Interrupt                                   */ 
  FDET_IRQn                     = 4,       /*!<  4    FDET Interrupt                                           */
  ADC_IRQn                      = 5,       /*!<  5    ADC Interrupt                                            */
  RAMP_IRQn                     = 6,       /*!<  6    RAM parity check Interrupt                               */
  SPI0_IRQn                     = 7,       /*!<  7    SPI0 Interrupt                                           */
  SPI1_IRQn                     = 8,       /*!<  8    SPI1 Interrupt                                           */
  DAC_IRQn                      = 9,       /*!<  9    DAC Interrupt                                            */
  UART0_IRQn                    = 10,      /*!<  10   UART0 global Interrupt                                   */
  UART1_IRQn                    = 11,      /*!<  11   UART1 global Interrupt                                   */
  UART2_IRQn                    = 12,      /*!<  12   UART2 global Interrupt                                   */
  UART3_IRQn                    = 13,      /*!<  13   UART3 global Interrupt                                   */ 
  UART4_IRQn                    = 14,      /*!<  14   UART4 global Interrupt                                   */
  FSCAN_IRQn                    = 15,      /*!<  15   FSCAN Interrupt                                          */
  LPUARTx_IRQn                  = 16,      /*!<  16   LPUARTx Interrupt                                        */
  I2CSMBx_IRQn                  = 17,      /*!<  17   I2Cx global Interrupt                                    */
  CLM_PGL_IRQ                   = 18,      /*!<  18   CLM and PGL Interrupt                                    */
  AES_IRQn                      = 19,      /*!<  19   AES Interrupt                                            */ 
  LPTIM16_IRQn                  = 20,      /*!<  20   LPTIM16 Interrupt                                        */
  DMA_IRQn                      = 21,      /*!<  21   DMA Interrupt                                            */
  WKUPx_IRQn                    = 22,      /*!<  22   WKUP Interrupt                                           */
  SENTx_IRQn                    = 23,      /*!<  23   SENT Interrupt                                           */
  BSTIM16_IRQn                  = 24,      /*!<  24   BSTIM16 Interrupt                                        */
  COMPx_IRQn                    = 25,      /*!<  25   COMPx Interrupt                                          */
  GPTIM0_IRQn                   = 26,      /*!<  26   GTIM0 global Interrupt                                   */
  GPTIM1_IRQn                   = 27,      /*!<  27   GTIM1 global Interrupt                                   */
  ATIM_IRQn                     = 28,      /*!<  28   ATIM global Interrupt                                    */
  TAU0_IRQn                      = 29,      /*!<  29   TAU0 Interrupt                                          */
  GPIO_IRQn                     = 30,      /*!<  30   GPIO Interrupt                                           */
  LED_LCD_IRQn                  = 31       /*!<  31   LED and LCD Interrupt                                    */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */


