XKCANO/ceshi0223/KD001-0111/CMSIS/inc/fm33lf0xx.h
#include "core_cm0plus.h"                            /*!< Cortex-M0 processor and core peripherals             */
#include "system_fm33lf0xx.h"                        /*!< FM33LF0XX System                                     */
#include <stdint.h>

/** @addtogroup Peripheral_registers_structures
  * @{
  */   

/** 
  * @brief Analog to Digital Converter  
  */
typedef struct
{
  __IO uint32_t ACQ_ISR;              	/*!< ACQ Interrupt and Status Flag Register,              Address offset: 0x00 */
  __IO uint32_t ACQ_IER;              	/*!< ACQ Interrupt Enable Register,                       Address offset: 0x04 */
  __IO uint32_t GISR;                	/*!< ADC General Interrupt and Status Flag Register,      Address offset: 0x08 */
  __IO uint32_t GIER;                	/*!< ADC General Interrupt Enable Register,               Address offset: 0x0C */
  __IO uint32_t CR1;                 	/*!< ADC Control Register1,                               Address offset: 0x10 */
  __IO uint32_t CR2;                 	/*!< ADC Control Register2,                               Address offset: 0x14 */
  __IO uint32_t RSV0;                	/*!< RESERVED REGISTER0,                                  Address offset: 0x18 */
  __IO uint32_t CFGR1;               	/*!< ADC Config Register1,                                Address offset: 0x1C */
  __IO uint32_t CFGR2;               	/*!< ADC Config Register2,                                Address offset: 0x20 */
  __IO uint32_t RSV1;                	/*!< RESERVED REGISTER1,                                  Address offset: 0x24 */
  __IO uint32_t RSV2;                	/*!< RESERVED REGISTER2,                                  Address offset: 0x28 */
  __IO uint32_t OSR;                 	/*!< ADC Channel Enable Register,                         Address offset: 0x2C */
  __IO uint32_t ACQ_SR;               	/*!< ADC Channel Enable Register,                         Address offset: 0x30 */
  __IO uint32_t ACQ_SACR;             	/*!< ADC Channel Enable Register,                         Address offset: 0x34 */
  __IO uint32_t HLTR;                	/*!< ADC Channel Enable Register,                         Address offset: 0x38 */
  __IO uint32_t AWDCR;               	/*!< ADC Channel Enable Register,                         Address offset: 0x3C */
  __IO uint32_t ACQ0_CR;              	/*!< ADC Channel Enable Register,                         Address offset: 0x40 */
  __IO uint32_t ACQ1_CR;              	/*!< ADC Channel Enable Register,                         Address offset: 0x44 */
  __IO uint32_t ACQ2_CR;              	/*!< ADC Channel Enable Register,                         Address offset: 0x48 */
  __IO uint32_t ACQ3_CR;              	/*!< ADC Channel Enable Register,                         Address offset: 0x4C */
  __IO uint32_t SCANACQ_CR;           	/*!< ADC Channel Enable Register,                         Address offset: 0x50 */
  __IO uint32_t RSV3[11];             	/*!< ADC Channel Enable Register,                         Address offset: 0x54 */
  __IO uint32_t ACQ0_DR;              	/*!< ADC Channel Enable Register,                         Address offset: 0x80 */
  __IO uint32_t ACQ1_DR;              	/*!< ADC Channel Enable Register,                         Address offset: 0x84 */
  __IO uint32_t ACQ2_DR;              	/*!< ADC Channel Enable Register,                         Address offset: 0x88 */
  __IO uint32_t ACQ3_DR;              	/*!< ADC Channel Enable Register,                         Address offset: 0x8C */
  __IO uint32_t SCANACQ_DR;           	/*!< ADC Channel Enable Register,                         Address offset: 0x90 */	
} ADC_Type;

typedef struct
{
  __IO uint32_t CR;               		/*!< AES Control Register,                                Address offset: 0x00 */
  __IO uint32_t IER;              		/*!< AES Interrupt Enable Register,                       Address offset: 0x04 */
  __IO uint32_t ISR;              		/*!< AES Interrupt Status Register,                       Address offset: 0x08 */
  __IO uint32_t DIR;              		/*!< AES Data Input Register,                             Address offset: 0x0C */
  __IO uint32_t DOR;              		/*!< AES Data Output Register,                            Address offset: 0x10 */
  __IO uint32_t KEY0;             		/*!< AES Key Register 0,                                  Address offset: 0x14 */
  __IO uint32_t KEY1;             		/*!< AES Key Register 1,                                  Address offset: 0x18 */
  __IO uint32_t KEY2;             		/*!< AES Key Register 2,                                  Address offset: 0x1C */
  __IO uint32_t KEY3;             		/*!< AES Key Register 3,                                  Address offset: 0x20 */    
  __IO uint32_t KEY4;             		/*!< AES Key Register 4,                                  Address offset: 0x24 */    
  __IO uint32_t KEY5;             		/*!< AES Key Register 5,                                  Address offset: 0x28 */    
  __IO uint32_t KEY6;             		/*!< AES Key Register 6,                                  Address offset: 0x2C */
  __IO uint32_t KEY7;             		/*!< AES Key Register 7,                                  Address offset: 0x30 */
  __IO uint32_t IVR0;             		/*!< AES Initial Vector Register 0,                       Address offset: 0x34 */
  __IO uint32_t IVR1;             		/*!< AES Initial Vector Register 1,                       Address offset: 0x38 */
  __IO uint32_t IVR2;             		/*!< AES Initial Vector Register 2,                       Address offset: 0x3C */
  __IO uint32_t IVR3;             		/*!< AES Initial Vector Register 3,                       Address offset: 0x40 */
  __IO uint32_t H0;               		/*!< AES MultH Parametre Register 0,                      Address offset: 0x44 */
  __IO uint32_t H1;               		/*!< AES MultH Parametre Register 0,                      Address offset: 0x48 */
  __IO uint32_t H2;               		/*!< AES MultH Parametre Register 0,                      Address offset: 0x4C */
  __IO uint32_t H3;               		/*!< AES MultH Parametre Register 0,                      Address offset: 0x50 */
} AES_Type;

typedef struct
{
  __IO uint32_t CR1;              		/*!< ATIM Control Register1,                              Address offset: 0x00 */
  __IO uint32_t CR2;              		/*!< ATIM Control Register2,                              Address offset: 0x04 */
  __IO uint32_t SMCR;             		/*!< ATIM Slave Mode Control Register,                    Address offset: 0x08 */
  __IO uint32_t DIER;             		/*!< ATIM DMA and Interrupt Enable Register,              Address offset: 0x0C */
  __IO uint32_t ISR;              		/*!< ATIM Interrupt Status Register,                      Address offset: 0x10 */
  __IO uint32_t EGR;              		/*!< ATIM Event Generation Register,                      Address offset: 0x14 */
  __IO uint32_t CCMR1;            		/*!< ATIM Capture/Compare Mode Register1,                 Address offset: 0x18 */
  __IO uint32_t CCMR2;            		/*!< ATIM Capture/Compare Mode Register2,                 Address offset: 0x1C */
  __IO uint32_t CCER;             		/*!< ATIM Capture/Compare Enable Register,                Address offset: 0x20 */
  __IO uint32_t CNT;              		/*!< ATIM Counter Register,                               Address offset: 0x24 */
  __IO uint32_t PSC;              		/*!< ATIM Prescaler Register,                             Address offset: 0x28 */
  __IO uint32_t ARR;              		/*!< ATIM Auto-Reload Register,                           Address offset: 0x2C */
  __IO uint32_t RCR;              		/*!< ATIM Repetition Counter Register,                    Address offset: 0x30 */
  __IO uint32_t CCR1;             		/*!< ATIM Capture/Compare Register1,                      Address offset: 0x34 */
  __IO uint32_t CCR2;             		/*!< ATIM Capture/Compare Register2,                      Address offset: 0x38 */
  __IO uint32_t CCR3;             		/*!< ATIM Capture/Compare Register3,                      Address offset: 0x3C */
  __IO uint32_t CCR4;             		/*!< ATIM Capture/Compare Register4,                      Address offset: 0x40 */
  __IO uint32_t BDTR;             		/*!< ATIM Break and Deadtime Register,                    Address offset: 0x44 */
  __IO uint32_t CCMR3;            		/*!< ATIM Capture/Compare Mode Register3,                 Address offset: 0x48 */
  __IO uint32_t CCR5;             		/*!< ATIM Capture/Compare Register5,                      Address offset: 0x4C */
  __IO uint32_t CCR6;             		/*!< ATIM Capture/Compare Register6,                      Address offset: 0x50 */
  __IO uint32_t ECR;              		/*!< ATIM Encoder Mode Control Register,                  Address offset: 0x54 */
  __IO uint32_t TISEL;            		/*!< ATIM timer input selection Register,                 Address offset: 0x58 */
  __IO uint32_t AFR;              		/*!< ATIM alternate function Register,                    Address offset: 0x5C */
  __IO uint32_t RSV0[38];          		/*!< RESERVED REGISTER,                                   Address offset: 0x60 */
  __IO uint32_t DCR;              		/*!< ATIM DMA Control Register,                           Address offset: 0xF8 */
  __IO uint32_t DMAR;             		/*!< ATIM DMA Access Register,                            Address offset: 0xFC */
 
