XKCANO/ceshi0223/KD001-0111/CMSIS/inc/fm33lf0xx.h
} ATIM_Type;

typedef struct
{
  __IO uint32_t CR1;              		/*!< BSTIM Control Register1,                             Address offset: 0x00 */
  __IO uint32_t CR2;              		/*!< BSTIM Control Register2,                             Address offset: 0x04 */
  __IO uint32_t RSV0;             		/*!< RESERVED REGISTER0,                                  Address offset: 0x08 */
  __IO uint32_t IER;              		/*!< BSTIM Interrupt Enable Register,                     Address offset: 0x0C */
  __IO uint32_t ISR;              		/*!< BSTIM Interrupt Status Register,                     Address offset: 0x10 */
  __IO uint32_t EGR;              		/*!< BSTIM Event Generation Register,                     Address offset: 0x14 */
  __IO uint32_t RSV1;             		/*!< RESERVED REGISTER1,                                  Address offset: 0x18 */
  __IO uint32_t RSV2;             		/*!< RESERVED REGISTER2,                                  Address offset: 0x1C */
  __IO uint32_t RSV3;             		/*!< RESERVED REGISTER3,                                  Address offset: 0x20 */
  __IO uint32_t CNT;              		/*!< BSTIM Counter Register,                              Address offset: 0x24 */
  __IO uint32_t PSC;              		/*!< BSTIM Prescaler Register,                            Address offset: 0x28 */
  __IO uint32_t ARR;              		/*!< BSTIM Auto-Reload Register,                          Address offset: 0x2C */
} BSTIM16_Type;

typedef struct
{
  __IO uint32_t CR;              		/*!< ComparatorControl Register 1,                        Address offset: 0x00 */

} COMP_Type;

typedef struct
{
  __IO uint32_t ICR;             		/*!< Comparator Interrupt Config Register,                Address offset: 0x00 */
  __IO uint32_t ISR;             		/*!< Comparator Interrupt Status Register,                Address offset: 0x04 */
  __IO uint32_t RSV0;            		/*!< RESERVED REGISTER0,                                  Address offset: 0x08 */  
  __IO uint32_t BUFCR;           		/*!< Comparator Interrupt Status Register,                Address offset: 0x0C */
} COMP_COMMON_Type;

typedef struct
{
  __IO uint32_t DR;               		/*!< CRC Data Register,                                   Address offset: 0x00 */
  __IO uint32_t CR;               		/*!< CRC Control Register,                                Address offset: 0x04 */
  __IO uint32_t LFSR;             		/*!< CRC Linear Feedback Shift Register,                  Address offset: 0x08 */
  __IO uint32_t XOR;              		/*!< CRC output XOR Register,                             Address offset: 0x0C */
  __IO uint32_t RSV0;             		/*!< RESERVED REGISTER0,                                  Address offset: 0x10 */
  __IO uint32_t RSV1;             		/*!< RESERVED REGISTER1,                                  Address offset: 0x14 */
  __IO uint32_t RSV2;             		/*!< RESERVED REGISTER2,                                  Address offset: 0x18 */
  __IO uint32_t POLY;             		/*!< CRC Polynominal Register,                            Address offset: 0x1C */
} CRC_Type;

typedef struct
{
  __IO uint32_t RSV0;
  __IO uint32_t RSV1;    
  __IO uint32_t CR;               		/*!< Debug Configuration Register */
  __IO uint32_t HDFR;             		/*!< HardFault Flag Register*/
    
} DBG_Type;

typedef struct
{
  __IO uint32_t CH0CR;                  /*!<  Channel 0 Control Register,                           Address offset: 0x00 */
  __IO uint32_t CH0CFGR;                /*!<  Channel 0 Config Register,                            Address offset: 0x04 */
  __IO uint32_t CH0PAR;                 /*!<  Channel 0 Peripheral Address Register,                Address offset: 0x08 */
  __IO uint32_t CH0MAR0;                /*!<  Channel 0 Memory Address Register0,                   Address offset: 0x0C */
  __IO uint32_t CH0MAR1;                /*!<  Channel 0 Memory Address Register1,                   Address offset: 0x10 */
  __IO uint32_t RSV1[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x14 */
  __IO uint32_t CH1CR;                  /*!<  Channel 1 Control Register,                           Address offset: 0x20 */
  __IO uint32_t CH1CFGR;                /*!<  Channel 1 Config Register,                            Address offset: 0x24 */
  __IO uint32_t CH1PAR;                 /*!<  Channel 1 Peripheral Address Register,                Address offset: 0x28 */
  __IO uint32_t CH1MAR0;                /*!<  Channel 1 Memory Address Register0,                   Address offset: 0x2C */
  __IO uint32_t CH1MAR1;                /*!<  Channel 1 Memory Address Register1,                   Address offset: 0x30 */
  __IO uint32_t RSV2[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x34 */
  __IO uint32_t CH2CR;                  /*!<  Channel 2 Control Register,                           Address offset: 0x40 */
  __IO uint32_t CH2CFGR;                /*!<  Channel 2 Config Register,                            Address offset: 0x44 */
  __IO uint32_t CH2PAR;                 /*!<  Channel 2 Peripheral Address Register,                Address offset: 0x48 */
  __IO uint32_t CH2MAR0;                /*!<  Channel 2 Memory Address Register0,                   Address offset: 0x4C */
  __IO uint32_t CH2MAR1;                /*!<  Channel 2 Memory Address Register1,                   Address offset: 0x50 */
  __IO uint32_t RSV3[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x54 */
  __IO uint32_t CH3CR;                  /*!<  Channel 3 Control Register,                           Address offset: 0x60 */
  __IO uint32_t CH3CFGR;                /*!<  Channel 3 Config Register,                            Address offset: 0x64 */
  __IO uint32_t CH3PAR;                 /*!<  Channel 3 Peripheral Address Register,                Address offset: 0x68 */
  __IO uint32_t CH3MAR0;                /*!<  Channel 3 Memory Address Register0,                   Address offset: 0x6C */
  __IO uint32_t CH3MAR1;                /*!<  Channel 3 Memory Address Register1,                   Address offset: 0x70 */
  __IO uint32_t RSV4[27];               /*!<  RESERVED REGISTER,                                    Address offset: 0x74 */
  __IO uint32_t CH7CR;                  /*!<  Channel 7 Control Register,                           Address offset: 0xE0 */
  __IO uint32_t CH7FAR;                 /*!<  Channel 7 Flash Address Register,                     Address offset: 0xE4 */
  __IO uint32_t CH7RAR;                 /*!<  Channel 7 RAM Address Register,                       Address offset: 0xE8 */
  __IO uint32_t RSV5[69];               /*!<  RESERVED REGISTER,                                    Address offset: 0xEC */
  __IO uint32_t GCR;                    /*!<  DMA Global Control Register,                          Address offset: 0x200 */
  __IO uint32_t SWRR;                   /*!<  DMA Software Request Register,                        Address offset: 0x204 */
  __IO uint32_t RSV6[62];               /*!<  RESERVED REGISTER,                                    Address offset: 0x208 */
  __IO uint32_t ISR;                    /*!<  DMA Interrupt Status Register,                        Address offset: 0x300 */
  __I  uint32_t CH0TFSADDR;             /*!<  ,                                                     Address offset: 0x304 */
  __I  uint32_t CH1TFSADDR;             /*!<  ,                                                     Address offset: 0x308 */
  __I  uint32_t CH2TFSADDR;             /*!<  ,                                                     Address offset: 0x30C */
  __I  uint32_t CH3TFSADDR;             /*!<  ,                                                     Address offset: 0x310 */
}DMA_Type;


typedef struct
{
  __IO uint32_t IER;              		/*!< XTLF Oscillation Fail Detection Interrupt Enable Register, Address offset: 0x00 */
  __IO uint32_t ISR;              		/*!< XTLF Oscillation Fail Detection Interrupt Status Register, Address offset: 0x04 */
}FDET_Type;


typedef struct
{
  __IO uint32_t RDCR;                   /*!<  Flash Read Control Register,                          Address offset: 0x00 */
  __IO uint32_t PFCR;                   /*!<  Flash Prefetch Control Register,                      Address offset: 0x04 */
  __IO uint32_t OPTBR;                	/*!<  Flash Option Bytes Register,                          Address offset: 0x08 */
  __IO uint32_t ACLOCK1;				/*!<  Flash Application Code Lock Register1,                Address offset: 0x0C */
  __IO uint32_t RSV1[1];  				/*!<  RESERVED REGISTER,                                    Address offset: 0x10 */
  __IO uint32_t EPCR;                   /*!<  Flash Erase/Program Control Register,                 Address offset: 0x14 */
  __O  uint32_t KEY;                    /*!<  Flash Key Register,                                   Address offset: 0x18 */
  __IO uint32_t IER;                    /*!<  Flash Interrupt Enable Register,                      Address offset: 0x1C */
  __IO uint32_t ISR;                    /*!<  Flash Interrupt Status Register,                      Address offset: 0x20 */
}FLASH_Type;


typedef struct
{
  __IO uint32_t INEN;             		/*!< Input Enable Register,                                 Address offset: 0x00*/
  __IO uint32_t PUDEN;             		/*!< Pull-Up Enable Register,                               Address offset: 0x04*/
  __IO uint32_t ODEN;             		/*!< Open-Drain Enable Register,                            Address offset: 0x08*/
  __IO uint32_t FCR;              		/*!< Function Control Register,                             Address offset: 0x0C*/
  __IO uint32_t DO;               		/*!< Data Output Register,                                  Address offset: 0x10*/    
  __O  uint32_t DSET;             		/*!< Data Set Register,                                     Address offset: 0x14*/
  __O  uint32_t DRST;             		/*!< Data Reset Register,                                   Address offset: 0x18*/
  __I uint32_t  DIN;              		/*!< Data Input Register,                                   Address offset: 0x1C*/
  __IO uint32_t DFS;              		/*!< Digital Function Select Register,                      Address offset: 0x20*/
  __IO uint32_t RSV0;              		/*!< RESERVED REGISTER,                                     Address offset: 0x24*/
  __IO uint32_t ANEN;             		/*!< Analog channel Enable Register,                        Address offset: 0x28*/
  __IO uint32_t DSR;             		/*!< Voltage Input Low Register,                            Address offset: 0x2C*/
} GPIO_Type;        

typedef struct
{
  __IO uint32_t EXTISEL;               	/*!<  External Interrupt Input Select Register0,            Address offset: 0x00 */
  __IO uint32_t RSV1;               	/*!<  External Interrupt Input Select Register1,            Address offset: 0x04 */
  __IO uint32_t EXTIEDS;               	/*!<  External Interrupt Edge Select and Enable Register0,  Address offset: 0x08 */
  __IO uint32_t RSV2;               	/*!<  External Interrupt Edge Select and Enable Register1,  Address offset: 0x0C */
  __IO uint32_t EXTIDF;                 /*!<  External Interrupt Digital Filter Register,           Address offset: 0x10 */
  __IO uint32_t EXTIISR;                /*!<  External Interrupt and Status Register,               Address offset: 0x14 */
  __I  uint32_t EXTIDI;                 /*!<  External Interrupt Data Input Register,               Address offset: 0x18 */
  __IO uint32_t RSV3[9];                /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t FOUTSEL;                /*!<  Frequency Output Select Register,                     Address offset: 0x40 */
  __IO uint32_t RSV4[63];               /*!<  RESERVED REGISTER,                                    Address offset: 0x44 */
  __IO uint32_t PINWKEN;                /*!<  Wakeup Enable Register,                               Address offset: 0x140 */
}GPIO_COMMON_Type;


typedef struct
{
  __IO uint32_t CR1;              		/*!< GPTIM Control Register1,                               Address offset: 0x00 */
  __IO uint32_t CR2;              		/*!< GPTIM Control Register2,                               Address offset: 0x04 */
  __IO uint32_t SMCR;             		/*!< GPTIM Slave Mode Control Register,                     Address offset: 0x08 */
  __IO uint32_t DIER;             		/*!< GPTIM DMA and Interrupt Enable Register,               Address offset: 0x0C */
  __IO uint32_t ISR;              		/*!< GPTIM Interrupt Status Register,                       Address offset: 0x10 */
  __IO uint32_t EGR;              		/*!< GPTIM EVENT GENERATE REGISTER,                         Address offset: 0x14 */
  __IO uint32_t CCMR1;            		/*!< GPTIM Capture/Compare Mode Register1,                  Address offset: 0x18 */
  __IO uint32_t CCMR2;            		/*!< GPTIM Capture/Compare Mode Register2,                  Address offset: 0x1C */
  __IO uint32_t CCER;             		/*!< GPTIM Capture/Compare Enable Register,                 Address offset: 0x20 */
  __IO uint32_t CNT;              		/*!< GPTIM Counter Register,                                Address offset: 0x24 */
  __IO uint32_t PSC;              		/*!< GPTIM Prescaler Register,                              Address offset: 0x28 */
  __IO uint32_t ARR;              		/*!< GPTIM Auto-Reload Register,                            Address offset: 0x2C */
  __IO uint32_t RSV0;             		/*!< RESERVED REGISTER0,                                    Address offset: 0x30 */
  __IO uint32_t CCR1;             		/*!< GPTIM Capture/Compare Register1,                       Address offset: 0x34 */
  __IO uint32_t CCR2;             		/*!< GPTIM Capture/Compare Register2,                       Address offset: 0x38 */
  __IO uint32_t CCR3;             		/*!< GPTIM Capture/Compare Register3,                       Address offset: 0x3C */
  __IO uint32_t CCR4;             		/*!< GPTIM Capture/Compare Register4,                       Address offset: 0x40 */
  __IO uint32_t RSV1[4];          		/*!< RESERVED REGISTER1,                                    Address offset: 0x44 */
  __IO uint32_t ECR;              		/*!< GPTIM Encoder Control Register,                        Address offset: 0x54 */
  __IO uint32_t ITRSEL;           		/*!< GPTIM Internal Trigger Select Register,                Address offset: 0x58 */
  __IO uint32_t AFR;              		/*!< GPTIM AF Register,                                     Address offset: 0x5C */
  __IO uint32_t RSV2[38];				/*!< RESERVED REGISTER2,                                    Address offset: 0x60 */
	__IO uint32_t DCR;              	/*!< GPTIM DMA Control Register,                            Address offset: 0xF8 */
  __IO uint32_t DMAR;             		/*!< GPTIM DMA Busrt Register,                              Address offset: 0xFC */
} GPTIM_Type; 

typedef struct
{
  __IO uint32_t OPRD;             		/*!< Dividend Register,                                     Address offset: 0x00 */
  __IO uint32_t SOR;              		/*!< Divisor Regsiter,                                      Address offset: 0x04 */
  __IO uint32_t QUOT;             		/*!< Quotient Register,                                     Address offset: 0x08 */
  __IO uint32_t REMD;             		/*!< Reminder Register,                                     Address offset: 0x0C */
  __IO uint32_t ROOT;             		/*!< ROOT Register,                                         Address offset: 0x10 */
  __IO uint32_t SR;               		/*!< Status Register,                                       Address offset: 0x14 */  
  __IO uint32_t CR;               		/*!< Control Register,                                      Address offset: 0x18 */ 
} DIVAS_Type;   


typedef struct
{
  __IO uint32_t CR1;                    /*!<  I2C SMBus Control Register,                           Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  I2C SMBus Control Register,                           Address offset: 0x04 */
  __IO uint32_t IER;                    /*!<  I2C SMBus Intterupt Enable Register,                  Address offset: 0x08 */
  __IO uint32_t ISR;                    /*!<  I2C Master Interrupt Status Register,                 Address offset: 0x0C */
  __IO uint32_t BGR;                    /*!<  ,                                                     Address offset: 0x10 */
  __IO uint32_t TIMINGR;                /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t TOR;                    /*!<  ,                                                     Address offset: 0x18 */
  __I  uint32_t RXDR;                   /*!<  ,                                                     Address offset: 0x1C */
  __IO uint32_t TXDR;                   /*!<  ,                                                     Address offset: 0x20 */
  __IO uint32_t SADR;                   /*!<  ,                                                     Address offset: 0x24 */
  __I  uint32_t CRC_DR;                 /*!<  ,                                                     Address offset: 0x28 */
  __IO uint32_t CRC_LFSR;               /*!<  ,                                                     Address offset: 0x2C */
  __IO uint32_t CRC_POLY;               /*!<  ,                                                     Address offset: 0x30 */
}I2CSMB_Type;

typedef struct
{
  __IO uint32_t SERV;             		/*!< IWDT Service Register,                                 Address offset: 0x00 */
  __IO uint32_t CR;               		/*!< IWDT Config Register,                                  Address offset: 0x04 */
  __I  uint32_t CNT;              		/*!< IWDT Counter Register,                                 Address offset: 0x08 */
  __IO uint32_t WIN;              		/*!< IWDT Window Register,                                  Address offset: 0x0C */
  __IO uint32_t IER;              		/*!< IWDT Status Register,                                  Address offset: 0x10 */
  __IO uint32_t ISR;              		/*!< IWDT Status Register,                                  Address offset: 0x10 */
} IWDT_Type;		    
		
typedef struct		
{		
  __IO uint32_t CR;               		/*!< LCD Control Register,                                  Address offset: 0x00 */
  __IO uint32_t TEST;             		/*!< LCD test Register,                                     Address offset: 0x04 */
  __IO uint32_t FCR;              		/*!< LCD Frequency Control Register,                        Address offset: 0x08 */
  __IO uint32_t FLKT;             		/*!< LCD Flick Time Register,                               Address offset: 0x0C */  
  __IO uint32_t RSV0;             		/*!< NULL,                                                  Address offset: 0x10 */
  __IO uint32_t IER;              		/*!< LCD Interrupt Enable Register,                         Address offset: 0x14 */
  __IO uint32_t ISR;              		/*!< LCD Interrupt Status Register,                         Address offset: 0x18 */
  __IO uint32_t RSV1;             		/*!< NULL,                                                  Address offset: 0x1C */    
  __IO uint32_t RSV2;             		/*!< NULL,                                                  Address offset: 0x20 */    
  __IO uint32_t DATA0;            		/*!< LCD data buffer registers 0,                           Address offset: 0x24 */    
  __IO uint32_t DATA1;            		/*!< LCD data buffer registers 1,                           Address offset: 0x28 */
  __IO uint32_t DATA2;            		/*!< LCD data buffer registers 2,                           Address offset: 0x2C */
  __IO uint32_t DATA3;            		/*!< LCD data buffer registers 3,                           Address offset: 0x30 */
  __IO uint32_t DATA4;            		/*!< LCD data buffer registers 4,                           Address offset: 0x34 */
  __IO uint32_t DATA5;            		/*!< LCD data buffer registers 5,                           Address offset: 0x38 */
  __IO uint32_t DATA6;            		/*!< LCD data buffer registers 6,                           Address offset: 0x3C */
  __IO uint32_t DATA7;            		/*!< LCD data buffer registers 7,                           Address offset: 0x40 */
  __IO uint32_t RSV3;             		/*!< NULL,                                                  Address offset: 0x44 */
  __IO uint32_t RSV4;             		/*!< NULL,                                                  Address offset: 0x48 */
  __IO uint32_t RSV5;             		/*!< NULL,                                                  Address offset: 0x4C */
  __IO uint32_t COMEN;            		/*!< LCD COM Enable Register,                               Address offset: 0x50 */
  __IO uint32_t SEGEN0;           		/*!< LCD SEG Enable Register0,                              Address offset: 0x54 */
} LCD_Type;

