XKCANO/ceshi0223/KD001-0111/CMSIS/inc/fm33lf0xx.h
typedef struct
{
  __IO uint32_t CR;               		/*!< LCD Control Register,                                   Address offset: 0x00 */
  __IO uint32_t CFGR;             		/*!< LCD test Register,                                      Address offset: 0x04 */
  __IO uint32_t RSV0;              		/*!< LCD Frequency Control Register,                         Address offset: 0x08 */
  __IO uint32_t IER;             		/*!< LCD Flick Time Register,                                Address offset: 0x0C */  
  __IO uint32_t ISR;             		/*!< NULL,                                                   Address offset: 0x10 */
  __IO uint32_t RSV1[3];              	/*!< LCD Interrupt Enable Register,                          Address offset: 0x14 */
  __IO uint32_t PWMCRA;              	/*!< LCD Interrupt Status Register,                          Address offset: 0x18 */
  __IO uint32_t PWMCRB;             	/*!< NULL,                                                   Address offset: 0x1C */    
  __IO uint32_t PWMCRC;             	/*!< NULL,                                                   Address offset: 0x20 */    
  __IO uint32_t PWMCRD;            		/*!< LCD data buffer registers 0,                            Address offset: 0x24 */    
  __IO uint32_t RSV2[4];            	/*!< LCD data buffer registers 1,                            Address offset: 0x28 */
  __IO uint32_t DOT0DR;            		/*!< LCD data buffer registers 2,                            Address offset: 0x2C */
  __IO uint32_t DOT1DR;            		/*!< LCD data buffer registers 3,                            Address offset: 0x30 */
  __IO uint32_t DOT2DR;            		/*!< LCD data buffer registers 4,                            Address offset: 0x34 */
  __IO uint32_t DOT3DR;            		/*!< LCD data buffer registers 5,                            Address offset: 0x38 */
  __IO uint32_t DOT4DR;            		/*!< LCD data buffer registers 6,                            Address offset: 0x3C */
  __IO uint32_t DOT5DR;            		/*!< LCD data buffer registers 7,                            Address offset: 0x40 */
  __IO uint32_t DOT6DR;             	/*!< NULL,                                                   Address offset: 0x44 */
  __IO uint32_t DOT7DR;             	/*!< NULL,                                                   Address offset: 0x48 */
  __IO uint32_t DOT8DR;             	/*!< NULL,                                                   Address offset: 0x4C */
  __IO uint32_t DOT9DR;             	/*!< NULL,                                                   Address offset: 0x4C */
  __IO uint32_t RSV3[6];            	/*!< LCD data buffer registers 1,                            Address offset: 0x28 */
  __IO uint32_t DMACR;            		/*!< LCD COM Enable Register,                                Address offset: 0x50 */
  __IO uint32_t DPCAR;           		/*!< LCD SEG Enable Register0,                               Address offset: 0x54 */
  __IO uint32_t DDRAR;           		/*!< LCD SEG Enable Register0,                               Address offset: 0x54 */
  __IO uint32_t CCOM;           		/*!< LCD SEG Enable Register0,                               Address offset: 0x54 */
} LED_Type;

typedef struct
{
  __IO uint32_t CFGR;             		/*!< LPTIM Config Register,                                 Address offset: 0x00 */
  __IO uint32_t CNT;              		/*!< LPTIM Counter Register,                                Address offset: 0x04 */
  __IO uint32_t CCSR;             		/*!< LPTIM Capture/Compare Control and Status Register,     Address offset: 0x08 */
  __IO uint32_t ARR;              		/*!< LPTIM Auto-Reload Register,                            Address offset: 0x0C */
  __IO uint32_t IER;              		/*!< LPTIM Interrupt Enable Register,                       Address offset: 0x10 */
  __IO uint32_t ISR;              		/*!< LPTIM Interrupt Status Register,                       Address offset: 0x14 */
  __IO uint32_t CR;               		/*!< LPTIM Control Register,                                Address offset: 0x18 */    
  __IO uint32_t RSV0;              		/*!< RESERVED REGISTER,                                     Address offset: 0x1C */
  __IO uint32_t CCR1;             		/*!< LPTIM Capture/Compare Register1,                       Address offset: 0x20 */
  __IO uint32_t CCR2;             		/*!< LPTIM Capture/Compare Register2,                       Address offset: 0x24 */
} LPTIM16_Type;

typedef struct
{
  __IO uint32_t CSR;              		/*!< LPUART Control Status Register,                        Address offset: 0x00 */
  __IO uint32_t IER;              		/*!< LPUART Interrupt Enable Register,                      Address offset: 0x04 */
  __IO uint32_t ISR;              		/*!< LPUART Interrupt Status Register,                      Address offset: 0x08 */
  __IO uint32_t BMR;              		/*!< LPUART Baud rate Modulation Register,                  Address offset: 0x0C */
  __IO uint32_t RXBUF;            		/*!< LPUART Receive Buffer Register,                        Address offset: 0x10 */
  __IO uint32_t TXBUF;            		/*!< LPUART Transmit Buffer Register,                       Address offset: 0x14 */
  __IO uint32_t DMR;              		/*!< LPUART  data Matching Register,                        Address offset: 0x18 */    
} LPUART_Type;



typedef struct
{
  __IO uint32_t CR;                     /*!<  Power Management Control Register,                    Address offset: 0x00 */
  __IO uint32_t WKTR;                   /*!<  Wakeup Time Register,                                 Address offset: 0x04 */
  __IO uint32_t WKFR0;                  /*!<  Wakeup Source Flags Register,                         Address offset: 0x08 */
  __IO uint32_t WKFR1;                  /*!<  Wakeup Source Flags Register,                         Address offset: 0x0C */
  __IO uint32_t RSV1[11];               /*!<  RESERVED REGISTER,                                    Address offset: 0x10 */ 
  __IO uint32_t BUFCR;                 	/*!<   Analog Buffer Control Register,                      Address offset: 0x3C */
  __IO uint32_t RSV2[4];                /*!<  RESERVED REGISTER,                                    Address offset: 0x40 */
  __IO uint32_t PTATCR;                	/*!<  PMU PTAT Control Register,                            Address offset: 0x50 */
}PMU_Type;



typedef struct
{
  __IO uint32_t SYSCLKCR;         		/*!< System Clock Control Register               ,          Address offset: 0x0C */
  __IO uint32_t RCHFCR;           		/*!< RCHF Control Register                       ,          Address offset: 0x10 */
  __IO uint32_t RCHFTR;           		/*!< RCHF Trim Register                          ,          Address offset: 0x14 */
  __IO uint32_t PLLCR;            		/*!< PLL Control Register                        ,          Address offset: 0x18 */
  __IO uint32_t RCLPCR;          		/*!< LPOSC Control Register                      ,          Address offset: 0x1C */
  __IO uint32_t RCLPTR;          		/*!< LPOSC Trim Register                         ,          Address offset: 0x20 */
  __IO uint32_t XTLFCR;           		/*!< XTLF CONFIG REGISTER                        ,          Address offset: 0x24 */
  __IO uint32_t LSCLKSEL;         		/*!< LSCLK Select Register                       ,          Address offset: 0x38 */
  __IO uint32_t XTHFCR;           		/*!< XTHF Control Register                       ,          Address offset: 0x60 */
  __IO uint32_t RSV0[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
  __IO uint32_t IER;                    /*!<  Interrupt Enable Register,                            Address offset: 0x2C */
  __IO uint32_t ISR;                    /*!<  Interrupt Status Register,                            Address offset: 0x30 */
  __IO uint32_t PCLKCR1;          		/*!< Peripheral bus Clock Control Register1      ,          Address offset: 0x28 */
  __IO uint32_t PCLKCR2;          		/*!< Peripheral bus Clock Control Register2      ,          Address offset: 0x2C */
  __IO uint32_t PCLKCR3;          		/*!< Peripheral bus Clock Control Register3      ,          Address offset: 0x30 */
  __IO uint32_t PCLKCR4;          		/*!< Peripheral bus Clock Control Register4      ,          Address offset: 0x34 */
  __IO uint32_t OPCCR1;           		/*!< Peripheral Operation Clock Control Register1,          Address offset: 0x6C */    
  __IO uint32_t OPCCR2;           		/*!< Peripheral Operation Clock Control Register2,          Address offset: 0x70 */
  __IO uint32_t OPCER1;           		/*!< Peripheral Operation Clock Control Register2,          Address offset: 0x70 */
  __IO uint32_t OPCER2;           		/*!< Peripheral Operation Clock Control Register2,          Address offset: 0x70 */
  __IO uint32_t AHBMCR;           		/*!< AHB Master Control Register                 ,          Address offset: 0x44 */
} CMU_Type;

typedef struct
{
  __IO uint32_t CR;            			/*!< PDR Control Register  */
  __IO uint32_t CFGR;            		/*!< BOR Control Register  */
	__IO uint32_t CNTR;            		/*!< BOR Control Register  */
	__IO uint32_t ISR;            		/*!< BOR Control Register  */
	__IO uint32_t CMPH;            		/*!< BOR Control Register  */
	__IO uint32_t CMPL;            		/*!< BOR Control Register  */
} CLM_Type;

typedef struct
{
  __IO uint32_t PDRCR;                  /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t BORCR;                  /*!<  ,                                                     Address offset: 0x04 */
  __IO uint32_t LKPCR;                  /*!<  ,                                                     Address offset: 0x08 */
  __O  uint32_t SOFTRST;                /*!<  ,                                                     Address offset: 0x0C */
  __IO uint32_t RSTFR;                  /*!<  ,                                                     Address offset: 0x10 */
  __O  uint32_t PRSTEN;                 /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t AHBRSTCR;               /*!<  ,                                                     Address offset: 0x18 */
  __IO uint32_t APBRSTCR1;              /*!<  ,                                                     Address offset: 0x1C */
  __IO uint32_t APBRSTCR2;              /*!<  ,                                                     Address offset: 0x20 */
}RMU_Type;

typedef struct
{   
  __IO uint32_t CR;               		/*!< RESERVED REGISTER,                                     Address offset: 0x00 */
  __IO uint32_t DOR;              		/*!< RNG OUTPUT REGISTER,                                   Address offset: 0x04 */
  __IO uint32_t RSV0;             		/*!< RESERVED REGISTER,                                     Address offset: 0x08 */
  __IO uint32_t RSV1;             		/*!< RESERVED REGISTER,                                     Address offset: 0x0C */
  __IO uint32_t SR;               		/*!< RNG FLAG REGISTER,                                     Address offset: 0x10 */    
  __IO uint32_t CRCCR;            		/*!< RNG CRC CONTROL REGISTER,                              Address offset: 0x14 */    
  __IO uint32_t CRCDIR;           		/*!< RNG CRC INPUT REGISTER,                                Address offset: 0x18 */    
  __IO uint32_t CRCSR;            		/*!< RNG CRC FLAG REGISTER,                                 Address offset: 0x1C */        
} RNG_Type; 
    
typedef struct
{   
  __IO uint32_t WER;              		/*!< RTC Write Enable Register,                             Address offset: 0x00 */
  __IO uint32_t IER;              		/*!< RTC Interrupt Enable Register,                         Address offset: 0x04 */
  __IO uint32_t ISR;              		/*!< RTC Interrupt Status Register,                         Address offset: 0x08 */
  __IO uint32_t BCDSEC;           		/*!< RTC SECOND IN BCD REGISTER,                            Address offset: 0x0C */
  __IO uint32_t BCDMIN;           		/*!< RTC MINITE IN BCD REGISTER,                            Address offset: 0x10 */
  __IO uint32_t BCDHOUR;          		/*!< RTC HOUR IN BCD REGISTER,                              Address offset: 0x14 */
  __IO uint32_t BCDDAY;           		/*!< RTC DAY IN BCD REGISTER,                               Address offset: 0x18 */
  __IO uint32_t BCDWEEK;          		/*!< RTC WEEK IN BCD REGISTER,                              Address offset: 0x1C */    
  __IO uint32_t BCDMONTH;         		/*!< RTC MONTH IN BCD REGISTER,                             Address offset: 0x20 */    
  __IO uint32_t BCDYEAR;          		/*!< RTC YEAR IN BCD REGISTER,                              Address offset: 0x24 */    
  __IO uint32_t ALARM;            		/*!< RTC Alarm Register,                                    Address offset: 0x28 */
  __IO uint32_t TMSEL;            		/*!< RTC Time Mark Select,                                  Address offset: 0x2C */
  __IO uint32_t ADJUST;           		/*!< RTC time Adjust Register,                              Address offset: 0x30 */
  __IO uint32_t ADSIGN;           		/*!< RTC time Adjust Sign Register,                         Address offset: 0x34 */
  __IO uint32_t RSV0;             		/*!< NULL,                                                  Address offset: 0x38 */
  __IO uint32_t SBSCNT;           		/*!< RTC Sub-Second Counter,                                Address offset: 0x3C */
  __IO uint32_t CR;               		/*!< NULL,                                                  Address offset: 0x40 */
} RTC_Type; 

typedef struct
{
  __IO uint32_t T0CR;                   /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t RSV0[3];                /*!< NULL,                                                  Address offset: 0x04 */
  __IO uint32_t T0CFGR;                 /*!<  ,                                                     Address offset: 0x10 */	
  __IO uint32_t T1CFGR;                 /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t T2CFGR;                 /*!<  ,                                                     Address offset: 0x18 */
  __IO uint32_t T3CFGR;                 /*!<  ,                                                     Address offset: 0x1C */
  __IO uint32_t T4CFGR;                 /*!<  ,                                                     Address offset: 0x20 */
  __IO uint32_t T5CFGR;                 /*!<  ,                                                     Address offset: 0x24 */
  __IO uint32_t T6CFGR;                 /*!<  ,                                                     Address offset: 0x28 */
  __IO uint32_t T7CFGR;                 /*!<  ,                                                     Address offset: 0x2C */
  __IO uint32_t T0MDR;                  /*!<  ,                                                     Address offset: 0x30 */
  __IO uint32_t T1MDR;                  /*!<  ,                                                     Address offset: 0x34 */
  __IO uint32_t T2MDR;                  /*!<  ,                                                     Address offset: 0x38 */
  __IO uint32_t T3MDR;                  /*!<  ,                                                     Address offset: 0x3C */
  __IO uint32_t T4MDR;                  /*!<  ,                                                     Address offset: 0x40 */
  __IO uint32_t T5MDR;                  /*!<  ,                                                     Address offset: 0x44 */
  __IO uint32_t T6MDR;                  /*!<  ,                                                     Address offset: 0x48 */
  __IO uint32_t T7MDR;                  /*!<  ,                                                     Address offset: 0x4C */
  __IO uint32_t T0ARR;                  /*!<  ,                                                     Address offset: 0x50 */
  __IO uint32_t T1ARR;                  /*!<  ,                                                     Address offset: 0x54 */
  __IO uint32_t T2ARR;                  /*!<  ,                                                     Address offset: 0x58 */
  __IO uint32_t T3ARR;                  /*!<  ,                                                     Address offset: 0x5C */
  __IO uint32_t T4ARR;                  /*!<  ,                                                     Address offset: 0x60 */
  __IO uint32_t T5ARR;                  /*!<  ,                                                     Address offset: 0x64 */
  __IO uint32_t T6ARR;                  /*!<  ,                                                     Address offset: 0x68 */
  __IO uint32_t T7ARR;                  /*!<  ,                                                     Address offset: 0x6C */
  __IO uint32_t T0CCR;                  /*!<  ,                                                     Address offset: 0x70 */
  __IO uint32_t T1CCR;                  /*!<  ,                                                     Address offset: 0x74 */
  __IO uint32_t T2CCR;                  /*!<  ,                                                     Address offset: 0x78 */
  __IO uint32_t T3CCR;                  /*!<  ,                                                     Address offset: 0x7C */
  __IO uint32_t T4CCR;                  /*!<  ,                                                     Address offset: 0x80 */
  __IO uint32_t T5CCR;                  /*!<  ,                                                     Address offset: 0x84 */
  __IO uint32_t T6CCR;                  /*!<  ,                                                     Address offset: 0x88 */
  __IO uint32_t T7CCR;                  /*!<  ,                                                     Address offset: 0x8C */
  __IO uint32_t T0IER;                  /*!<  ,                                                     Address offset: 0x90 */
  __IO uint32_t T1IER;                  /*!<  ,                                                     Address offset: 0x94 */
  __IO uint32_t T2IER;                  /*!<  ,                                                     Address offset: 0x98 */
  __IO uint32_t T3IER;                  /*!<  ,                                                     Address offset: 0x9C */
  __IO uint32_t T4IER;                  /*!<  ,                                                     Address offset: 0xA0 */
  __IO uint32_t T5IER;                  /*!<  ,                                                     Address offset: 0xA4 */
  __IO uint32_t T6IER;                  /*!<  ,                                                     Address offset: 0xA8 */
  __IO uint32_t T7IER;                  /*!<  ,                                                     Address offset: 0xAC */
  __IO uint32_t T0ISR;                  /*!<  ,                                                     Address offset: 0xB0 */
  __IO uint32_t T1ISR;                  /*!<  ,                                                     Address offset: 0xB4 */
  __IO uint32_t T2ISR;                  /*!<  ,                                                     Address offset: 0xB8 */
  __IO uint32_t T3ISR;                  /*!<  ,                                                     Address offset: 0xBC */
  __IO uint32_t T4ISR;                  /*!<  ,                                                     Address offset: 0xC0 */
  __IO uint32_t T5ISR;                  /*!<  ,                                                     Address offset: 0xC4 */
  __IO uint32_t T6ISR;                  /*!<  ,                                                     Address offset: 0xC8 */
  __IO uint32_t T7ISR;                  /*!<  ,                                                     Address offset: 0xCC */
  __I  uint32_t T0CNTR;                 /*!<  ,                                                     Address offset: 0xD0 */
  __I  uint32_t T1CNTR;                 /*!<  ,                                                     Address offset: 0xD4 */
  __I  uint32_t T2CNTR;                 /*!<  ,                                                     Address offset: 0xD8 */
  __I  uint32_t T3CNTR;                 /*!<  ,                                                     Address offset: 0xDC */
  __I  uint32_t T4CNTR;                 /*!<  ,                                                     Address offset: 0xE0 */
  __I  uint32_t T5CNTR;                 /*!<  ,                                                     Address offset: 0xE4 */
  __I  uint32_t T6CNTR;                 /*!<  ,                                                     Address offset: 0xE8 */
  __I  uint32_t T7CNTR;                 /*!<  ,                                                     Address offset: 0xEC */
}TAU0_Type;

typedef struct
{
  __IO uint32_t CR;              	 	/*!< OPA Control Register               */
  __IO uint32_t CALR;             		/*!< OPA Calibration Register           */
  __IO uint32_t COR;              		/*!< OPA Calibration Output Register      */
} OPA_Type;

typedef struct
{
  __IO uint32_t CR1;              		/*!< SPI Control Register1         */
  __IO uint32_t CR2;              		/*!< SPI Control Register2         */
  __IO uint32_t CR3;              		/*!< SPI Control Register3         */
  __IO uint32_t IER;              		/*!< SPI Interrupt Enable Register */
  __IO uint32_t ISR;              		/*!< SPI Status Register           */    
  __IO uint32_t TXBUF;            		/*!< SPI Transmit Buffer           */
  __IO uint32_t RXBUF;            		/*!< SPI Receive Buffer            */
  __IO uint32_t I2SCR;            		/*!< SPI I2S Control Register,                              Address offset: 0x20 */
  __IO uint32_t I2SPR;            		/*!< SPI I2S Prescaler Register,                            Address offset: 0x24 */
} SPI_Type;

typedef struct
{
  __IO uint32_t CR1;                    /*!<  DAC Control Register,                                 Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  DAC Control Register,                                 Address offset: 0x04 */
  __IO uint32_t CFGR;                   /*!<  DAC Config Register,                                  Address offset: 0x08 */
  __O  uint32_t SWTRGR;                 /*!<  DAC Software Trigger Register,                        Address offset: 0x0C */
  __IO uint32_t DHR;                    /*!<  DAC Data Holding Register,                            Address offset: 0x10 */
  __IO uint32_t ISR;                    /*!<  DAC Interrupt Status Register,                        Address offset: 0x14 */
  __IO uint32_t IER;                    /*!<  DAC Interrupt Enable Register,                        Address offset: 0x18 */
}DAC_Type;

