XKCANO/ceshi0223/KD001-0111/CMSIS/inc/fm33lf0xx.h
typedef struct
{
  __IO uint32_t CR;                     /*!<  PGL Control Register,                                 Address offset: 0x00 */
  __IO uint32_t CFGR0;                  /*!<  PGL Config Register0,                                 Address offset: 0x04 */
  __IO uint32_t CFGR1;                  /*!<  PGL Config Register1,                                 Address offset: 0x08 */
  __IO uint32_t CFGR2;                  /*!<  PGL Config Register2,                                 Address offset: 0x0C */
  __IO uint32_t CFGR3;                  /*!<  PGL Config Register3,                                 Address offset: 0x10 */
  __IO uint32_t IER;                    /*!<  PGL Interrupt Enable Register,                        Address offset: 0x14 */
  __IO uint32_t ISR;                    /*!<  PGL Interrupt Status Register,                        Address offset: 0x18 */
  __IO uint32_t LUT0;                   /*!<  Look Up Table0,                                       Address offset: 0x1C */
  __IO uint32_t LUT1;                   /*!<  Look Up Table1,                                       Address offset: 0x20 */
  __IO uint32_t LUT2;                   /*!<  Look Up Table2,                                       Address offset: 0x24 */
  __IO uint32_t LUT3;                   /*!<  Look Up Table3,                                       Address offset: 0x28 */
}PGL_Type;

typedef struct
{
  __IO uint32_t CR;                     /*!<  PGL Control Register,                                 Address offset: 0x00 */
  __IO uint32_t CFGR;                   /*!<  PGL Config Register,                                  Address offset: 0x04 */
  __IO uint32_t PSR;                    /*!<  PGL Prescaler Register1,                              Address offset: 0x08 */
  __IO uint32_t FTR;                    /*!<  PGL Config Register2,                                 Address offset: 0x0C */
  __IO uint32_t SR;                     /*!<  PGL Config Register3,                                 Address offset: 0x10 */
  __IO uint32_t DR;                     /*!<  PGL Interrupt Enable Register,                        Address offset: 0x14 */
  __IO uint32_t SYNC;                   /*!<  PGL Interrupt Status Register,                        Address offset: 0x18 */
  __IO uint32_t RCAL;                   /*!<  Look Up Table0,                                       Address offset: 0x1C */
}SENT_Type;

typedef struct
{
  __IO uint32_t CR;                     /*!<  CANControlRegister,                                   Address offset: 0x00 */
  __IO uint32_t MSR;                    /*!<  CANmodeselectregister,                                Address offset: 0x04 */
  __IO uint32_t BRPR;                   /*!<  CANBaudratePrescalerRegister,                         Address offset: 0x08 */
  __IO uint32_t BTR;                    /*!<  CANBitTimingRegister,                                 Address offset: 0x0C */
  __I  uint32_t ECR;                    /*!<  CANErrorCounterRegister,                              Address offset: 0x10 */
  __IO uint32_t ESR;                    /*!<  CANErrorStatusRegister,                               Address offset: 0x14 */
  __I  uint32_t SR;                     /*!<  CANStatusRegister,                                    Address offset: 0x18 */
  __IO uint32_t RXISR;                  /*!<  CANInterruptStatusRegister,                           Address offset: 0x1C */
  __IO uint32_t RXIER;                  /*!<  CANInterruptEnableRegister,                           Address offset: 0x20 */
  __IO uint32_t RSV0;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
  __IO uint32_t TXBCR;                  /*!<  CANTransmitBufferControlRegister,                     Address offset: 0x28 */
  __IO uint32_t TXBSR;                  /*!<  CANTransmitBufferStatusRegister,                      Address offset: 0x2C */
  __O  uint32_t TXB0IDR;                /*!<  CANTransmitBuffer0IDRegister,                         Address offset: 0x30 */
  __O  uint32_t TXB0DLCR;               /*!<  CANTransmitBuffer0DLCRegister,                        Address offset: 0x34 */
  __O  uint32_t TXB0DW1R;               /*!<  CANTransmitBuffer0DataWord1Register,                  Address offset: 0x38 */
  __O  uint32_t TXB0DW2R;               /*!<  CANTransmitBuffer0DataWord2Register,                  Address offset: 0x3C */
  __O  uint32_t TXB1IDR;                /*!<  CANTransmitBuffer1IDRegister,                         Address offset: 0x40 */
  __O  uint32_t TXB1DLCR;               /*!<  CANTransmitBuffer1DLCRegister,                        Address offset: 0x44 */
  __O  uint32_t TXB1DW1R;               /*!<  CANTransmitBuffer1DataWord1Register,                  Address offset: 0x48 */
  __O  uint32_t TXB1DW2R;               /*!<  CANTransmitBuffer1DataWord2Register,                  Address offset: 0x4C */
  __O  uint32_t TXB2IDR;                /*!<  CANTransmitBuffer2IDRegister,                         Address offset: 0x50 */
  __O  uint32_t TXB2DLCR;               /*!<  CANTransmitBuffer2DLCRegister,                        Address offset: 0x54 */
  __O  uint32_t TXB2DW1R;               /*!<  CANTransmitBuffer2DataWord1Register,                  Address offset: 0x58 */
  __O  uint32_t TXB2DW2R;               /*!<  CANTransmitBuffer2DataWord2Register,                  Address offset: 0x5C */
  __IO uint32_t AFCR;                   /*!<  AcceptanceFilterControlRegister,                      Address offset: 0x60 */
  __IO uint32_t AFCFGR;                 /*!<  AcceptanceFilterConfigRegister,                       Address offset: 0x64 */
  __IO uint32_t RSV1[6];                /*!<  RESERVED REGISTER,                                    Address offset: 0x68 */
  __IO uint32_t AFMR0;                  /*!<  AcceptanceFilterMaskRegister0,                        Address offset: 0x80 */
  __IO uint32_t AFIR0;                  /*!<  AcceptanceFilterIDRegister0,                          Address offset: 0x84 */
  __IO uint32_t AFMR1;                  /*!<  AcceptanceFilterMaskRegister1,                        Address offset: 0x88 */
  __IO uint32_t AFIR1;                  /*!<  AcceptanceFilterIDRegister1,                          Address offset: 0x8C */
  __IO uint32_t AFMR2;                  /*!<  ,                                                     Address offset: 0x90 */
  __IO uint32_t AFIR2;                  /*!<  ,                                                     Address offset: 0x94 */
  __IO uint32_t AFMR3;                  /*!<  ,                                                     Address offset: 0x98 */
  __IO uint32_t AFIR3;                  /*!<  ,                                                     Address offset: 0x9C */
  __IO uint32_t AFMR4;                  /*!<  ,                                                     Address offset: 0xA0 */
  __IO uint32_t AFIR4;                  /*!<  ,                                                     Address offset: 0xA4 */
  __IO uint32_t AFMR5;                  /*!<  ,                                                     Address offset: 0xA8 */
  __IO uint32_t AFIR5;                  /*!<  ,                                                     Address offset: 0xAC */
  __IO uint32_t AFMR6;                  /*!<  ,                                                     Address offset: 0xB0 */
  __IO uint32_t AFIR6;                  /*!<  ,                                                     Address offset: 0xB4 */
  __IO uint32_t AFMR7;                  /*!<  ,                                                     Address offset: 0xB8 */
  __IO uint32_t AFIR7;                  /*!<  ,                                                     Address offset: 0xBC */
  __IO uint32_t AFMR8;                  /*!<  ,                                                     Address offset: 0xC0 */
  __IO uint32_t AFIR8;                  /*!<  ,                                                     Address offset: 0xC4 */
  __IO uint32_t AFMR9;                  /*!<  ,                                                     Address offset: 0xC8 */
  __IO uint32_t AFIR9;                  /*!<  ,                                                     Address offset: 0xCC */
  __IO uint32_t AFMR10;                 /*!<  ,                                                     Address offset: 0xD0 */
  __IO uint32_t AFIR10;                 /*!<  ,                                                     Address offset: 0xD4 */
  __IO uint32_t AFMR11;                 /*!<  ,                                                     Address offset: 0xD8 */
  __IO uint32_t AFIR11;                 /*!<  ,                                                     Address offset: 0xDC */
  __IO uint32_t AFMR12;                 /*!<  ,                                                     Address offset: 0xE0 */
  __IO uint32_t AFIR12;                 /*!<  ,                                                     Address offset: 0xE4 */
  __IO uint32_t AFMR13;                 /*!<  ,                                                     Address offset: 0xE8 */
  __IO uint32_t AFIR13;                 /*!<  ,                                                     Address offset: 0xEC */
  __IO uint32_t AFMR14;                 /*!<  ,                                                     Address offset: 0xF0 */
  __IO uint32_t AFIR14;                 /*!<  ,                                                     Address offset: 0xF4 */
  __IO uint32_t AFMR15;                 /*!<  AcceptanceFilterMaskRegister15,                       Address offset: 0xF8 */
  __IO uint32_t AFIR15;                 /*!<  AcceptanceFilterIDRegister15,                         Address offset: 0xFC */
  __O  uint32_t RXFIDR;                 /*!<  CANRXFIFOIDRegister,                                  Address offset: 0x100 */
  __O  uint32_t RXFDLCR;                /*!<  CANRXFIFODLCRegister,                                 Address offset: 0x104 */
  __O  uint32_t RXFDW1R;                /*!<  CANRXFIFODataWord1Register,                           Address offset: 0x108 */
  __O  uint32_t RXFDW2R;                /*!<  CANRXFIFODataWord2Register,                           Address offset: 0x10C */
}FSCAN_Type;

typedef struct
{
  __IO uint32_t RAMP_CR;                /*!<  RAM Parity Control Register,                          Address offset: 0x00 */
  __IO uint32_t RAMP_SR;                /*!<  RAM Parity Status Register,                           Address offset: 0x04 */
  __IO uint32_t MAP_CR;                 /*!<  Memory Access Protection Control Register,            Address offset: 0x08 */
  __IO uint32_t MAP_SR;                 /*!<  Memory Access Protection Control Register,            Address offset: 0x0C */
}SFU_Type;

typedef struct
{
  __IO uint32_t CFGR;             		/*!< SVD Config Register,                                   Address offset: 0x24 */
  __IO uint32_t CR;               		/*!< SVD Control Register,                                  Address offset: 0x28 */
  __IO uint32_t IER;              		/*!< SVD Interrupt Enable Register,                         Address offset: 0x2C */
  __IO uint32_t ISR;              		/*!< SVD Interrupt Status Register,                         Address offset: 0x30 */
  __IO uint32_t VSR;              		/*!< SVD reference Voltage Select Register,                 Address offset: 0x34 */
} SVD_Type; 

typedef struct 
{
  __IO uint32_t IRCR;             		/*!< Infrared modulation Control Register */          
} UART_COMMON_Type;
     
typedef struct
{
  __IO uint32_t CSR;                    /*!<  UARTx Control Status Register,                        Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  UARTx Interrupt Enable Register,                      Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<  UARTx Interrupt Status Register,                      Address offset: 0x08 */
  __IO uint32_t TODR;                   /*!<  UARTx Time-Out and Delay Register,                    Address offset: 0x0C */
  __I  uint32_t RXBUF;                  /*!<  UARTx Receive Buffer,                                 Address offset: 0x10 */
  __O  uint32_t TXBUF;                  /*!<  UARTx Transmit Buffer,                                Address offset: 0x14 */
  __IO uint32_t BGR;                    /*!<  UARTx Baud rate Generator Register,                   Address offset: 0x18 */
  __IO uint32_t RSV0;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t MCR;                    /*!<  UARTx Mode Control Register,                          Address offset: 0x20 */
  __IO uint32_t LINCR;                  /*!<  UARTx LIN Control Register,                           Address offset: 0x24 */
  __IO  uint32_t LINBSR;                /*!<  UARTx LIN Baud Sync Register,                         Address offset: 0x28 */
  __IO uint32_t LINFTR;               	/*!<  UARTx LIN Frame Timeout Register,                     Address offset: 0x2C */
  __IO uint32_t LINTTR;              	/*!<  UARTx LIN Time Register,                              Address offset: 0x30 */
  __IO uint32_t LINPSR;               	/*!<  UARTx LIN Pre Sync Register,                          Address offset: 0x34 */
  __IO uint32_t LINBKR;					/*!<  UARTx LIN Break LEN Register                          Address offset: 0x38 */
  __IO uint32_t RSV1;               	/*!<  RESERVED REGISTER,                                   	Address offset: 0x3C */
  __IO uint32_t SCISR;                  /*!<  UARTx Smart Card Interrupt Status Register,           Address offset: 0x40 */
  __IO uint32_t SCIER;                  /*!<  UARTx Smart Card Interrupt Enable Register,           Address offset: 0x44 */
  __IO uint32_t FFCR;                   /*!<  UARTx Smart Card Frame Format Control Register,       Address offset: 0x48 */
  __IO uint32_t EGTR;                   /*!<  UARTx Smart Card Extra Guard Time Register,           Address offset: 0x4C */
  __IO uint32_t CODR;                   /*!<  UARTx Smart Card Clock Output Register,               Address offset: 0x50 */
  __IO uint32_t RSV2[11];				/*!<  RESERVED REGISTER,  									Address offset: 0x54 */
  __IO uint32_t LINSCCR;                /*!<  UARTx LIN Self-Test Control Register, 				Address offset: 0x80 */
}UART_Type;

typedef struct
{
  __IO uint32_t CR;               		/*!< WWDT Control Register,                                 Address offset: 0x00 */
  __IO uint32_t CFGR;             		/*!< WWDT Config Register,                                  Address offset: 0x04 */
  __IO uint32_t CNT;              		/*!< WWDT Counter Register,                                 Address offset: 0x08 */
  __IO uint32_t IER;              		/*!< WWDT Interrupt Enable Register,                        Address offset: 0x0C */
  __IO uint32_t ISR;              		/*!< WWDT Interrupt Status Register,                        Address offset: 0x10 */
  __IO uint32_t PSC;              		/*!< WWDT Prescaler Register,                               Address offset: 0x14 */    
} WWDT_Type;    



/** @addtogroup Peripheral_memory_map
  * @{
  */       
#define FLASH_BASE            0x00000000UL /*!< FLASH(up to 1 MB) base address in the alias region      */    
#define SRAM_BASE             0x20000000UL
#define PERIPH_BASE           0x40000000UL

/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

/*!< Peripheral memory map */
#define DBG_BASE              (PERIPH_BASE + 0x00000000UL)
#define DMA_BASE              (PERIPH_BASE + 0x00000400UL)
#define GPIOA_BASE            (PERIPH_BASE + 0x00000C00UL)
#define GPIOB_BASE            (PERIPH_BASE + 0x00000C40UL)
#define GPIOC_BASE            (PERIPH_BASE + 0x00000C80UL)
#define GPIOD_BASE            (PERIPH_BASE + 0x00000CC0UL)
#define GPIO_COMMON_BASE      (PERIPH_BASE + 0x00000DC0UL)
#define SFU_BASE              (PERIPH_BASE + 0x00002C00UL)
#define CRC_BASE              (PERIPH_BASE + 0x00010000UL) 
#define FLS_BASE              (PERIPH_BASE + 0x00001000UL)
#define PMU_BASE              (PERIPH_BASE + 0x00002000UL)
#define CMU_BASE              (PERIPH_BASE + 0x00002400UL)
#define RMU_BASE              (PERIPH_BASE + 0x00002800UL)
#define SPI0_BASE             (PERIPH_BASE + 0x00010400UL)
#define SPI1_BASE             (PERIPH_BASE + 0x00010800UL)
#define LCD_BASE              (PERIPH_BASE + 0x00010C00UL) 
#define RTC_BASE              (PERIPH_BASE + 0x00011000UL)
#define IWDT_BASE             (PERIPH_BASE + 0x00011400UL)    
#define WWDT_BASE             (PERIPH_BASE + 0x00011800UL)
#define I2CSMB0_BASE          (PERIPH_BASE + 0x00011C00UL)
#define UART0_BASE            (PERIPH_BASE + 0x00012000UL)
#define I2CSMB1_BASE          (PERIPH_BASE + 0x00012400UL)
#define SVD_BASE              (PERIPH_BASE + 0x00012800UL)
#define TAU0_BASE             (PERIPH_BASE + 0x00013000UL)
#define AES_BASE              (PERIPH_BASE + 0x00013800UL)
#define RNG_BASE              (PERIPH_BASE + 0x00013C00UL)
#define LPUART0_BASE          (PERIPH_BASE + 0x00014000UL)
#define LPUART1_BASE          (PERIPH_BASE + 0x00014400UL)
#define GPTIM0_BASE           (PERIPH_BASE + 0x00014C00UL)
#define COMP1_BASE            (PERIPH_BASE + 0x00015400UL)
#define COMP2_BASE            (PERIPH_BASE + 0x00015404UL)
#define COMP3_BASE            (PERIPH_BASE + 0x00015408UL)
#define COMP4_BASE            (PERIPH_BASE + 0x0001540CUL)
#define COMP_COMMON_BASE      (PERIPH_BASE + 0x00015410UL)
#define OPA1_BASE             (PERIPH_BASE + 0x00015800UL)
#define OPA2_BASE             (PERIPH_BASE + 0x00015820UL)
#define ADC_BASE              (PERIPH_BASE + 0x00015C00UL)
#define DAC_BASE              (PERIPH_BASE + 0x00016000UL)
#define GPTIM1_BASE           (PERIPH_BASE + 0x00016400UL)
#define UART1_BASE            (PERIPH_BASE + 0x00016800UL)
#define PGL_BASE              (PERIPH_BASE + 0x00016C00UL)
#define UART2_BASE            (PERIPH_BASE + 0x00017000UL)
#define UART3_BASE            (PERIPH_BASE + 0x00017400UL)
#define UART4_BASE            (PERIPH_BASE + 0x00017800UL)
#define UART_COMMON_BASE      (PERIPH_BASE + 0x00017C00UL) 
#define ATIM_BASE             (PERIPH_BASE + 0x00018000UL)
#define LPTIM16_BASE          (PERIPH_BASE + 0x00018800UL)
#define BSTIM16_BASE          (PERIPH_BASE + 0x00018C00UL)
#define DIVAS_BASE            (PERIPH_BASE + 0x00019C00UL)  
#define SENT0_BASE            (PERIPH_BASE + 0x0001A000UL)  
#define FSCAN_BASE            (PERIPH_BASE + 0x0001A400UL) 
#define SENT1_BASE            (PERIPH_BASE + 0x0001A800UL)  
#define LED_BASE              (PERIPH_BASE + 0x0001AC00UL)  
#define CLM0_BASE             (PERIPH_BASE + 0x0001B000UL) 
#define CLM1_BASE             (PERIPH_BASE + 0x0001B400UL) 
/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

