XKCANO/ceshi0223/KD001-0111/CMSIS/inc/fm33lf0xx.h
#define DBG                   ((DBG_Type *) DBG_BASE)
#define DMA                   ((DMA_Type *) DMA_BASE)
#define GPIOA                 ((GPIO_Type *) GPIOA_BASE)
#define GPIOB                 ((GPIO_Type *) GPIOB_BASE)
#define GPIOC                 ((GPIO_Type *) GPIOC_BASE)
#define GPIOD                 ((GPIO_Type *) GPIOD_BASE)
#define GPIO                  ((GPIO_COMMON_Type *) GPIO_COMMON_BASE)
#define SFU                   ((SFU_Type *) SFU_BASE)
#define CRC                   ((CRC_Type *) CRC_BASE)
#define FLASH                 ((FLASH_Type *) FLS_BASE)
#define PMU                   ((PMU_Type *) PMU_BASE)
#define CMU                   ((CMU_Type *) CMU_BASE)
#define RMU                   ((RMU_Type *) RMU_BASE)
#define SPI0                  ((SPI_Type *) SPI0_BASE)
#define SPI1                  ((SPI_Type *) SPI1_BASE)
#define LCD                   ((LCD_Type *) LCD_BASE)
#define RTC                   ((RTC_Type *) RTC_BASE)
#define IWDT                  ((IWDT_Type *) IWDT_BASE)
#define WWDT                  ((WWDT_Type *) WWDT_BASE)
#define I2CSMB0               ((I2CSMB_Type *) I2CSMB0_BASE)
#define UART0                 ((UART_Type *) UART0_BASE)
#define I2CSMB1               ((I2CSMB_Type *) I2CSMB1_BASE)
#define SVD                   ((SVD_Type *) SVD_BASE)
#define TAU0                  ((TAU0_Type *) TAU0_BASE)
#define AES                   ((AES_Type *) AES_BASE)
#define RNG                   ((RNG_Type *) RNG_BASE)
#define LPUART0               ((LPUART_Type *) LPUART0_BASE)
#define LPUART1               ((LPUART_Type *) LPUART1_BASE)
#define GPTIM0                ((GPTIM_Type *) GPTIM0_BASE)
#define COMP1                 ((COMP_Type *) COMP1_BASE)
#define COMP2                 ((COMP_Type *) COMP2_BASE)
#define COMP3                 ((COMP_Type *) COMP3_BASE)
#define COMP4                 ((COMP_Type *) COMP4_BASE)
#define COMP                  ((COMP_COMMON_Type*) COMP_COMMON_BASE)
#define OPA1                  ((OPA_Type*) OPA1_BASE)
#define OPA2                  ((OPA_Type*) OPA2_BASE)
#define ADC                   ((ADC_Type *) ADC_BASE)
#define DAC                   ((DAC_Type *) DAC_BASE)
#define GPTIM1                ((GPTIM_Type *) GPTIM1_BASE)
#define UART1                 ((UART_Type *) UART1_BASE)
#define PGL                   ((PGL_Type *) PGL_BASE)
#define UART2                 ((UART_Type *) UART2_BASE)
#define UART3                 ((UART_Type *) UART3_BASE)
#define UART4                 ((UART_Type *) UART4_BASE)
#define UART                  ((UART_COMMON_Type *) UART_COMMON_BASE)
#define ATIM                  ((ATIM_Type *) ATIM_BASE)
#define LPTIM16               ((LPTIM16_Type *) LPTIM16_BASE)
#define BSTIM16               ((BSTIM16_Type *) BSTIM16_BASE)
#define DIVAS                 ((DIVAS_Type *) DIVAS_BASE)
#define FSCAN                 ((FSCAN_Type *) FSCAN_BASE)
#define SENT0                 ((SENT_Type *) SENT0_BASE)
#define SENT1                 ((SENT_Type *) SENT1_BASE)
#define LED                   ((LED_Type *) LED_BASE)
#define CLM0                  ((CLM_Type *) CLM0_BASE)
#define CLM1                  ((CLM_Type *) CLM1_BASE)
/* ================================================================================ */
/* ================             Peripheral include                 ================ */
/* ================================================================================ */

/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group FM33LF0XX */
/** @} */ /* End of group Keil */

#ifdef __cplusplus
}
#endif

#endif  /* FM33LF0XX_H */
